import ReactDOM from 'react-dom/client';
import React from 'react';
import './styles/main.css';
import App from './components/App/App';

const root = ReactDOM.createRoot(document.getElementById('app') as HTMLElement);
root.render(<App />);

// Добавить картинки рожиц на главную
//  Цветовая схема
// Главный заголовок (шрифты Roboto, Пиксельный)
// Кнопки в меню

// Игровое поле
// Прогресс игры сделать прогресс баром
// Оформить статистику в виде таблицы
// Кнопка сыграть еще акцентным цветом
// Выделить уровень сложности
// Выделить значения статистик акцентным цветом

// Результаты
// Выделять строку с результатами игры при ховере
// Шрифт (заголовок пиксельный, инфа робото)

// Правила
// Оформить таблоицой + карточками
